In [1]:
print("""
@File         : 02_preparing_data_4_eda.ipynb
@Author(s)    : Stephen CUI
@LastEditor(s): Stephen CUI
@CreatedTime  : 2024-09-21 21:34:09
@Email        : cuixuanstephen@gmail.com
@Description  : 为 EDA 准备数据
""")

@File         : 02_preparing_data_4_eda.ipynb
@Author(s)    : Stephen CUI
@LastEditor(s): Stephen CUI
@CreatedTime  : 2024-09-21 21:34:09
@Email        : cuixuanstephen@gmail.com
@Description  : 为 EDA 准备数据

In [2]:
%cd ../

d:\Data-Analysis-and-Science\EDAPC

## Grouping data

In [3]:
import pandas as pd

marketing_data = pd.read_csv(
    "DATA/marketing_campaign.csv",
    usecols=[
        "ID",
        "Year_Birth",
        "Education",
        "Marital_Status",
        "Income",
        "Kidhome",
        "Teenhome",
        "Dt_Customer",
        "Recency",
        "NumStorePurchases",
        "NumWebVisitsMonth",
    ],
)

In [4]:
marketing_data.head(2).T

                            0           1
ID                       5524        2174
Year_Birth               1957        1954
Education          Graduation  Graduation
Marital_Status         Single      Single
Income                58138.0     46344.0
Kidhome                     0           1
Teenhome                    0           1
Dt_Customer        04-09-2012  08-03-2014
Recency                    58          38
NumStorePurchases           4           2
NumWebVisitsMonth           7           5

In [5]:
marketing_data.dtypes

ID                     int64
Year_Birth             int64
Education             object
Marital_Status        object
Income               float64
Kidhome                int64
Teenhome               int64
Dt_Customer           object
Recency                int64
NumStorePurchases      int64
NumWebVisitsMonth      int64
dtype: object

In [6]:
marketing_data.shape

(2240, 11)

In [7]:
marketing_data.groupby('Kidhome')['NumStorePurchases'].mean()

Kidhome
0    7.217324
1    3.863181
2    3.437500
Name: NumStorePurchases, dtype: float64

- [Grouping Data: A Step-by-Step Tutorial to GroupBy in Pandas](https://www.dataquest.io/blog/grouping-data-a-step-by-step-tutorial-to-groupby-in-pandas/)

## Appending data

In [8]:
marketing_sample1 = pd.read_csv(
    "DATA/marketing_campaign_append1.csv",
    usecols=[
        "ID",
        "Year_Birth",
        "Education",
        "Marital_Status",
        "Income",
        "Kidhome",
        "Teenhome",
        "Dt_Customer",
        "Recency",
        "NumStorePurchases",
        "NumWebVisitsMonth",
    ],
)

marketing_sample2 = pd.read_csv(
    "DATA/marketing_campaign_append2.csv",
    usecols=[
        "ID",
        "Year_Birth",
        "Education",
        "Marital_Status",
        "Income",
        "Kidhome",
        "Teenhome",
        "Dt_Customer",
        "Recency",
        "NumStorePurchases",
        "NumWebVisitsMonth",
    ],
)

In [10]:
marketing_sample1.head(2).T

                            0           1
ID                       5524        2174
Year_Birth               1957        1954
Education          Graduation  Graduation
Marital_Status         Single      Single
Income                58138.0     46344.0
Kidhome                     0           1
Teenhome                    0           1
Dt_Customer        04/09/2012  08/03/2014
Recency                    58          38
NumStorePurchases           4           2
NumWebVisitsMonth           7           5

In [11]:
marketing_sample2.head(2).T

                            0           1
ID                       9135         466
Year_Birth               1950        1944
Education          Graduation  Graduation
Marital_Status       Together     Married
Income                  27203       65275
Kidhome                     1           0
Teenhome                    1           0
Dt_Customer        06/08/2012  03/04/2013
Recency                    92           9
NumStorePurchases           2          13
NumWebVisitsMonth           8           2

In [14]:
# 不完全一样
marketing_sample2.dtypes.equals(marketing_sample1.dtypes)
# 可能是在 Income 字段中有缺失值

False

In [18]:
marketing_sample2.columns.equals(marketing_sample1.columns)
# 这个是一样的就可以

True

In [20]:
appended_data = pd.concat([marketing_sample1, marketing_sample2])
appended_data.head(2).T

                            0           1
ID                       5524        2174
Year_Birth               1957        1954
Education          Graduation  Graduation
Marital_Status         Single      Single
Income                58138.0     46344.0
Kidhome                     0           1
Teenhome                    0           1
Dt_Customer        04/09/2012  08/03/2014
Recency                    58          38
NumStorePurchases           4           2
NumWebVisitsMonth           7           5

## Concatenating data

- [Tutorial: Concatenation (Combining Data Tables) with Pandas and Python](https://www.dataquest.io/blog/pandas-concatenation-tutorial/)

## Merging data

![维恩图展示了不同类型的连接](../IMAGES/2-1.png)

In [21]:
marketing_sample1 = pd.read_csv("data/marketing_campaign_merge1.csv")
marketing_sample2 = pd.read_csv("data/marketing_campaign_merge2.csv")

merged_data = pd.merge(marketing_sample1, marketing_sample2, on="ID")

In [23]:
merged_data.head()

     ID  Year_Birth   Education Marital_Status   Income
0  5524        1957  Graduation         Single  58138.0
1  2174        1954  Graduation         Single  46344.0
2  4141        1965  Graduation       Together  71613.0
3  6182        1984  Graduation       Together  26646.0
4  5324        1981         PhD        Married  58293.0

- [Combining Data in pandas With merge(), .join(), and concat()](https://realpython.com/pandas-merge-join-and-concat/)

## Sorting data

In [24]:
sorted_data = marketing_data.sort_values("NumStorePurchases", ascending=False)

In [26]:
sorted_data[['ID', 'NumStorePurchases']]

         ID  NumStorePurchases
1187   9855                 13
803    9930                 13
1144    819                 13
286   10983                 13
1150   1453                 13
...     ...                ...
164    8475                  0
2214   9303                  0
27     5255                  0
1042  10749                  0
2132  11181                  0

[2240 rows x 2 columns]

## Categorizing data

当我们提到对数据进行分类时，我们特指对数据集进行分箱、分组或切割。分箱涉及将数据集中的数值分组为较小的区间，称为箱或桶。当我们将数值分箱时，每个箱都变成一个分类值。箱非常有用，因为它们可以为我们提供见解，如果我们直接处理单个数值，这些见解可能很难发现。箱并不总是有相等的间隔；箱的创建取决于我们对数据集的理解。

分箱也可用于处理异常值或减少观测误差的影响。异常值是异常高或异常低的数据点，远离数据集中的其他数据点。它们通常会导致分析输出出现异常。分箱可以通过将包括异常值在内的数值范围放入特定桶中来减少这种影响，从而使值分类。一个常见的例子是当我们将年龄值转换为年龄组时。异常年龄（例如 0 或 150）可以分别落入小于 18 岁的箱和大于 80 岁的箱中。

In [27]:
marketing_data["bins"] = pd.cut(
    x=marketing_data["NumStorePurchases"],
    bins=[0, 4, 8, 13],
    labels=["Low", "Moderate", "High"],
)

In [28]:
marketing_data[['NumStorePurchases', 'bins']].head()

   NumStorePurchases      bins
0                  4       Low
1                  2       Low
2                 10      High
3                  4       Low
4                  6  Moderate

对于 bin 参数，我们还可以提供所需的 `bin` 数量，而不是手动提供 `bin` 边界。这意味着在前面的步
骤中，我们可以将值 3 提供给 `bin` 参数和 `cut` 方法会将我们的数据分类到三个等间距的箱中。当提供值 3 时，`cut` 方法会关注箱的等间距，即使箱中的记录数可能不同。

如果我们对箱体的分布感兴趣，而不仅仅是等距箱体或用户定义的箱体，则可以使用 pandas 中的 `qcut` 方法。`qcut` 方法可确保箱体中的数据分布相等。它可确保所有箱体都具有（大致）相同数量的观察值，即使箱体范围可能有所不同。

## Removing duplicate data

In [30]:
marketing_data = pd.read_csv("data/marketing_campaign.csv")
marketing_data = marketing_data[["Education", "Marital_Status", "Kidhome", "Teenhome"]]
marketing_data_duplicate = marketing_data.drop_duplicates()

marketing_data_duplicate.head()

    Education Marital_Status  Kidhome  Teenhome
0  Graduation         Single        0         0
1  Graduation         Single        1         1
2  Graduation       Together        0         0
3  Graduation       Together        1         0
4         PhD        Married        1         0

`drop_duplicates` 方法在基于列子集删除重复项方面提供了一定的灵活性。通过提供子集列的列表作为第一个参数，我们可以根据这些子集列删除包含重复项的所有行。当我们有多个列并且只有几个关键列包含重复信息时，这很有用。此外，它允许我们使用 `keep` 参数保留重复项的实例。使用 `keep` 参数，我们可以指定是要保留“第一个”或“最后一个”实例还是删除重复信息的所有实例。默认情况下，该方法保留第一个实例。

## Dropping data rows and columns

In [31]:
marketing_data = pd.read_csv(
    "data/marketing_campaign.csv",
    usecols=["ID", "Year_Birth", "Education", "Marital_Status"],
)

In [32]:
marketing_data.drop(labels=[1], axis=0)

         ID  Year_Birth   Education Marital_Status
0      5524        1957  Graduation         Single
2      4141        1965  Graduation       Together
3      6182        1984  Graduation       Together
4      5324        1981         PhD        Married
5      7446        1967      Master       Together
...     ...         ...         ...            ...
2235  10870        1967  Graduation        Married
2236   4001        1946         PhD       Together
2237   7270        1981  Graduation       Divorced
2238   8235        1956      Master       Together
2239   9405        1954         PhD        Married

[2239 rows x 4 columns]

In [33]:
marketing_data.drop(labels=['Year_Birth'], axis=1)

         ID   Education Marital_Status
0      5524  Graduation         Single
1      2174  Graduation         Single
2      4141  Graduation       Together
3      6182  Graduation       Together
4      5324         PhD        Married
...     ...         ...            ...
2235  10870  Graduation        Married
2236   4001         PhD       Together
2237   7270  Graduation       Divorced
2238   8235      Master       Together
2239   9405         PhD        Married

[2240 rows x 3 columns]

## Replacing data

In [36]:
marketing_data = pd.read_csv(
    "data/marketing_campaign.csv",
    usecols=["Education", "Marital_Status", "Kidhome", "Teenhome"],
)
marketing_data["Teenhome_replaced"] = marketing_data["Teenhome"].replace(
    [0, 1, 2], ["has no teen", "has teen", "has teen"]
) # 两个参数的列表长度必须相同
marketing_data[["Teenhome_replaced", 'Teenhome']].head()

  Teenhome_replaced  Teenhome
0       has no teen         0
1          has teen         1
2       has no teen         0
3       has no teen         0
4       has no teen         0

- [Replace Values in Pandas DataFrame](https://datatofish.com/replace-values-pandas-dataframe/)
- [Replace values in Pandas dataframe using regex](https://www.geeksforgeeks.org/replace-values-in-pandas-dataframe-using-regex/)
- [Python RegEx](https://www.w3schools.com/python/python_regex.asp)

## 更改数据格式

在 pandas 中，`dtypes` 属性帮助我们检查数据集中的数据类型，而 `astype` 属性帮助我们在各种数据类型之间转换数据集。

In [39]:
marketing_data = pd.read_csv(
    "data/marketing_campaign.csv",
    usecols=["ID", "Year_Birth", "Marital_Status", "Income"],
)
marketing_data["Income"] = marketing_data["Income"].fillna(0)
marketing_data["Income_changed"] = marketing_data["Income"].astype(int)
marketing_data[['Income','Income_changed']].head()

    Income  Income_changed
0  58138.0           58138
1  46344.0           46344
2  71613.0           71613
3  26646.0           26646
4  58293.0           58293

在转换数据类型时，我们可能会遇到转换错误。`astype` 方法通过 `errors` 参数为我们提供引发或忽略错误的选项。默认情况下，该方法会引发错误；但是，我们可以忽略错误，以便该方法返回识别的每个错误的原始值。

- [Overview of Pandas Data Types](https://pbpython.com/pandas_dtypes.html)

## Dealing with missing values

In [40]:
marketing_data = pd.read_csv(
    "data/marketing_campaign.csv", usecols=["ID", "Year_Birth", "Education", "Income"]
)
marketing_data.head()

     ID  Year_Birth   Education   Income
0  5524        1957  Graduation  58138.0
1  2174        1954  Graduation  46344.0
2  4141        1965  Graduation  71613.0
3  6182        1984  Graduation  26646.0
4  5324        1981         PhD  58293.0

In [41]:
marketing_data.isna().sum()

ID             0
Year_Birth     0
Education      0
Income        24
dtype: int64

In [42]:
marketing_data_withoutna = marketing_data.dropna(how="any")
marketing_data_withoutna.shape

(2216, 4)